OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.1949/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.604923436516442 0 -8.032707890084042)
	(21.907385154774662 0 -8.032707890084042)
	(21.907385154774662 9.006369452518472 -8.032707890084042)
	(-14.604923436516442 9.006369452518472 -8.032707890084042)
	(-14.604923436516442 0 3.6512308591291105)
	(21.907385154774662 0 3.6512308591291105)
	(21.907385154774662 9.006369452518472 3.6512308591291105)
	(-14.604923436516442 9.006369452518472 3.6512308591291105)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (150 37 48) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

