OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.1949/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      turbulenceProperties;
}

simulationType RAS;

RAS
{
	RASModel        kOmegaSST;
	turbulence      on;
	printCoeffs     on;
	decayControl    yes;
	kInf            0.00040684763686599896;
	omegaInf        1.131338119560893;
}

